app/controllers/companies_controller.rb

SELECT `companies`.* FROM `companies` WHERE (`companies`.`id` IN (2625, 2628, 2629, 2630, 2631, 5280, 7084, 7085, 7088, 7107, 7108, 7151, 10201, 10273, 10547, 10549, 10552, 10553, 14442, 24627))
---
  def load_business_categories
    @company = Company.find(params[:company_id]) rescue Company.new

SELECT `tags`.* FROM `tags` WHERE (name like('%r%')) LIMIT 15
---
  def autocomplete_tags
    items = Tag.where("name like('%#{params[:term]}%')").limit(15)