app/controllers/site_controller.rb

  def index
    @business_categories = BusinessCategory.all(:conditions=>"business_group_id is not null", :limit=>6, :group=>"business_group_id")
---
SELECT `business_categories`.* FROM `business_categories` WHERE (business_group_id is not null) GROUP BY business_group_id LIMIT 6